[{"id":0,"ext":"doc","name":"WordPad Document","desc":"Text document created with Microsoft WordPad (bundled with Microsoft Windows)","type":"Text Files"},{"id":1,"ext":"docx","name":"Microsoft Word Open XML Document","desc":"Document created by Microsoft Word word processing software; contains text, images, formatting, styles, drawn objects, and other document elements; used for authoring, business, academic, and personal documents; is one of the most popular word processing document formats.","type":"Text Files"},{"id":2,"ext":"log","name":"Log File","desc":"Log file used by various operating systems and programs; typically contains a plain text log of certain events with their timestamps; may be created by the operating system to keep track of system events or by a software installation program to list location and names of installed files.","type":"Data Files"},{"id":3,"ext":"msg","name":"Outlook Mail Message","desc":"Message created or saved within Microsoft Outlook; contains multiple e-mail fields, including the date, sender, recipient, subject, and message body; compatible with other programs that use Microsoft's Messaging Applications Programming Interface (MAPI).","type":"Text Files"},{"id":4,"ext":"odt","name":"OpenDocument Text Document","desc":"Text document created with Writer, the Apache OpenOffice and StarOffice word processor; formatted using the OASIS OpenDocument XML-based standard.","type":"Text Files"},{"id":5,"ext":"pages","name":"Pages Document","desc":"Document created by Apple Pages, a word processor and page layout program; may be a basic text document or a complex multi-page brochure; can include text, pictures, photos, tables, graphs, and charts; may be created from a blank page or built from a template.","type":"Text Files"},{"id":6,"ext":"rtf","name":"Rich Text Format File","desc":"Common text file format that supports \"rich text;\" may include several types of text formatting, such as bold type, italics, different fonts and font sizes, custom tab settings, etc; may also support images saved within the text file.","type":"Text Files"},{"id":7,"ext":"tex","name":"LaTeX Source Document","desc":"Document prepared by LaTeX, a high-quality typesetting system; can include text, symbols, mathematical expressions, and graphics; commonly used in computer science, electrical engineering, and physics for typesetting articles, books, and other publications.","type":"Raster Image Files"},{"id":8,"ext":"txt","name":"Plain Text File","desc":"Standard text document that contains unformatted text; recognized by any text editing or word processing program; can also be processed by most other software programs.","type":"Text Files"},{"id":9,"ext":"wpd","name":"WordPerfect Document","desc":"Text document created by Corel WordPerfect, a popular word processor; may contain formatted text, tables, drawn objects, and images; stored in a proprietary Corel format, but can be exported to other formats from within WordPerfect.","type":"Text Files"},{"id":10,"ext":"wps","name":"Kingsoft Writer Document","desc":"Word processing document created by Kingsoft Writer, a word processor that is part of the Kingsoft Office suite; similar to a Microsoft Word document (.DOC or .DOCX file) and supports formatted text, images, and advanced page formatting.","type":"Settings Files"},{"id":11,"ext":"csv","name":"Comma Separated Values File","desc":"File containing data sets separated by commas, where each new line represents a new database row, and each database row has one or more fields separated by a comma; can be organized into cells by a spreadsheet program or inserted into a database.","type":"Data Files"},{"id":12,"ext":"dat","name":"Minecraft Data File","desc":"Data file used by Minecraft, a 3D exploration and construction game; saved in a compressed Gzip format and may save various kinds of data, including player inventory, player position, and world information; used for saving world state information as well as for tracking player progress.","type":"Data Files"},{"id":13,"ext":"gbr","name":"Gerber File","desc":"Industry-standard file format used for creating printed circuit board (PCB) designs; recognized by PCB manufacturing machines and contains instructions for drilling and milling the board; also includes information about the board's electrical connections.","type":"Raster Image Files"},{"id":14,"ext":"ged","name":"GEDCOM Genealogy Data File","desc":"Stores family history and genealogical event data in the standard GEDCOM genealogy format; saves data in an ASCII text format that can be opened by different genealogy programs on multiple computer systems.","type":"Developer Files"},{"id":15,"ext":"ibooks","name":"Multi-Touch iBook","desc":"Digital book created for the Apple iPad; saved in the ePub 3 format with a few proprietary Apple-specific additions; may include text, images, videos, 3D objects, presentations, and other media; supports user interaction through multi-touch gestures.","type":"Data Files"},{"id":16,"ext":"key","name":"LightWave License File","desc":"Software registration file used by LightWave, a professional 3D rendering application; stores the 16-digit license key and enables users to have a legal copy of the software.","type":"System Files"},{"id":17,"ext":"keychain","name":"Mac OS X Keychain File","desc":"Keychain file created by Apple Keychain, a program bundled with Mac OS X that stores authentication information; contains an encrypted collection of resource authentication data, such as passwords, certificates, and private keys.","type":"Data Files"},{"id":18,"ext":"pps","name":"PowerPoint Slide Show","desc":"Slide show created with Microsoft PowerPoint, a common program for creating presentations; saved as a completed slide show, which can be viewed by either PowerPoint or PowerPoint Viewer; not editable like a .PPT file.","type":"Data Files"},{"id":19,"ext":"ppt","name":"PowerPoint Presentation","desc":"Editable slide show created with Microsoft PowerPoint; often used for presentations or slideshows; may include formatted text, bullet points, images, movies, sound effects, and music; often built from one of many templates included with the PowerPoint software, but may also be created from scratch.","type":"Data Files"},{"id":20,"ext":"pptx","name":"PowerPoint Open XML Presentation","desc":"Presentation file created by Microsoft PowerPoint, a program used to create slide show presentations; contains a collection of slides, including their text, images, formatting, animations, drawn objects, and other media; commonly used in business meetings, marketing applications, and academic classroom settings.","type":"Data Files"},{"id":21,"ext":"sdf","name":"Standard Data File","desc":"Standard database format used for storing data in a structured format; uses fields of fixed lengths to store values; can be imported and exported by various database and data analysis programs; commonly used for transferring data between different programs.","type":"Game Files"},{"id":22,"ext":"tar","name":"Consolidated Unix File Archive","desc":"Tar archive created by tar, a Unix-based utility used to package files together; contains multiple files stored in an uncompressed format; commonly compressed into a .GZ file using GNU Zip compression.","type":"Data Files"},{"id":23,"ext":"tax2012","name":"TurboTax 2012 Tax Return","desc":"Tax return created with TurboTax 2012, a United States tax preparation program; contains federal and often state tax forms, along with user data entered through TurboTax; stores your progress when completing a tax return and allows you to pause and resume your tax return at a later time.","type":"Data Files"},{"id":24,"ext":"vcf","name":"vCard File","desc":"Standard file format for storing contact information for a person or business; typically includes a name, address, phone number, e-mail address, and other contact information; also supports custom fields, images, and other types of media.","type":"Data Files"},{"id":25,"ext":"xml","name":"XML File","desc":"XML (Extensible Markup Language) data file that uses tags to define objects and object attributes; formatted much like an .HTML document, but uses custom tags to define objects and the data within each object; can be thought of as a text-based database.","type":"Data Files"},{"id":26,"ext":"aif","name":"Symbian Application Information File","desc":"Information file that specifies the icon and caption for a Symbian application (.APP) file; typically created with Symbian's AIF Builder and saved along with the corresponding application file.","type":"Audio Files"},{"id":27,"ext":"iff","name":"Interchange File Format","desc":"Universal file format created by Electronic Arts; may contain image, text, or audio data; used for interchanging different types of data across applications and platforms; supported by many programs and used as the basis for several other file formats, including AIFF.","type":"Audio Files"},{"id":28,"ext":"m3u","name":"Media Playlist File","desc":"Short for \"MP3 URL\" or \"Moving Picture Experts Group Audio Layer 3 Uniform Resource Locator;\" contains a playlist of MP3s and other audio or video files; lists the locations of media files in a plain text format; initially used by Winamp and is now supported by several other media players.","type":"Audio Files"},{"id":29,"ext":"m4a","name":"MPEG-4 Audio File","desc":"Audio file created in the MPEG-4 format, a multimedia container format used to store compressed audio and video data; contains audio encoded with either the Advanced Audio Coding (AAC) codec or the Apple Lossless Audio Codec (ALAC).","type":"Audio Files"},{"id":30,"ext":"mid","name":"MIDI File","desc":"Standard MIDI (Musical Instrument Digital Interface) file used by music authoring and mixing programs as well as MIDI hardware devices; contains music data, such as what notes are played, when they are played, how long each note is held, and how loud each note is played.","type":"GIS Files"},{"id":31,"ext":"mp3","name":"MP3 Audio File","desc":"Compressed audio format developed by the Moving Picture Experts Group; uses \"Layer 3\" audio compression; commonly used to store music files and audiobooks on a hard drive; may provide near-CD quality sound (stereo, 16-bit) in a file roughly 1\/10 the size of a .WAV or .AIF file.","type":"Audio Files"},{"id":32,"ext":"mpa","name":"MPEG-2 Audio File","desc":"Audio file compressed with MPEG Layer II compression; reduces the file size with having minimal effect on the overall sound quality; based on an the MPEG-1 audio-coding standard and was later updated for the MPEG-2 specification.","type":"Audio Files"},{"id":33,"ext":"ra","name":"Real Audio File","desc":"Audio file used by RealPlayer, an audio and video streaming program; may reference a streaming audio file online or may contain audio data; can use various codecs to compress audio with variable bit rates; uses a proprietary Real compression algorithm.","type":"Audio Files"},{"id":34,"ext":"wav","name":"WAVE Audio File","desc":"Standard digital audio file format used for storing waveform data; allows audio recordings to be saved with different sampling rates and bitrates; often saved in a 44.1 KHz, 16-bit, stereo format, which is the standard format used for CD audio.","type":"Audio Files"},{"id":35,"ext":"wma","name":"Windows Media Audio File","desc":"Audio file compressed with Windows Media compression; proprietary format developed by Microsoft, similar to the .MP3 format; can be converted to other more standardized formats; often used for playing music from the Web; Windows Media video files use a .WMV extension.","type":"Audio Files"},{"id":36,"ext":"3g2","name":"3GPP2 Multimedia File","desc":"Audio\/video format developed by the 3rd Generation Partnership Project 2 (3GPP2); designed for transmitting multimedia files over the Internet; basically an updated version of the .3GP format used by cell phones for saving video files.","type":"Video Files"},{"id":37,"ext":"3gp","name":"3GPP Multimedia File","desc":"Audio and video container format developed by the 3rd Generation Partnership Project (3GPP); designed as a multimedia format for transmitting audio and video files between 3G cell phones and over the Internet; commonly used by mobile phones that support video capture.","type":"Video Files"},{"id":38,"ext":"asf","name":"Advanced Systems Format File","desc":"Media file stored in the Advanced Systems Format (ASF), a proprietary video and audio container format; developed by Microsoft primarily for streaming media; contains audio and video data and optionally metadata, such as title, author, and copyright bibliographic data.","type":"Video Files"},{"id":39,"ext":"asx","name":"Microsoft ASF Redirector File","desc":"Multimedia playlist or shortcut to an audio\/video file (often an .ASF file); references one or more URLs that point to the locations of the audio and video files; used for storing multimedia playlists.","type":"Developer Files"},{"id":40,"ext":"avi","name":"Audio Video Interleave File","desc":"Video container or wrapper format created by Microsoft; stores video data that may be encoded in a variety of codecs; typically uses less compression than similar formats such as .MPEG and .MOV.","type":"Video Files"},{"id":41,"ext":"flv","name":"Flash Video File","desc":"Flash-compatible video file exported by the Flash Video Exporter plug-in (included with Adobe Flash) or other program with FLV file support; consists of a short header, interleaved audio, video, and metadata packets; audio and video data is stored in a similar format used by standard Flash (.SWF) files.","type":"Video Files"},{"id":42,"ext":"m4v","name":"iTunes Video File","desc":"MPEG-4 file extension used for videos downloaded from the Apple iTunes store; includes TV episodes, full-length movies, and music videos; similar to an .MP4 file, but may be copy-protected using Apple's FairPlay DRM copyright protection.","type":"Video Files"},{"id":43,"ext":"mov","name":"Apple QuickTime Movie","desc":"Common multimedia container file format developed by Apple and compatible with both Macintosh and Windows platforms; contains multiple tracks that store different types of media data; often used for saving movies and other video files; commonly uses the MPEG-4 codec for compression.","type":"Video Files"},{"id":44,"ext":"mp4","name":"MPEG-4 Video File","desc":"Movie or video clip that uses MPEG-4 compression, a standard developed by the Moving Picture Experts Group (MPEG); commonly used for sharing video files on the Internet.","type":"Video Files"},{"id":45,"ext":"mpg","name":"MPEG Video File","desc":"Common digital video format standardized by the Moving Picture Experts Group (MPEG); typically incorporates MPEG-1 or MPEG-2 audio and video compression; often used for creating movies that are distributed on the Internet.","type":"Video Files"},{"id":46,"ext":"rm","name":"Real Media File","desc":"Media file used by RealPlayer, an audio and video playback and streaming program; contains audio or video data or a link to a streaming media file, which is played back as it is downloaded; commonly used for Internet radio and Internet videos.","type":"Video Files"},{"id":47,"ext":"srt","name":"SubRip Subtitle File","desc":"Text file containing subtitles used by various video playback programs; supported by DivX, DVD, and other video formats; includes the time each subtitle should be displayed followed by the text of the subtitle.","type":"Video Files"},{"id":48,"ext":"swf","name":"Shockwave Flash Movie","desc":"Animation created with Adobe Flash; may contain text as well as both vector and raster graphics; also may include interactive actions written in ActionScript; plays in Web browsers that have the Flash plug-in installed.","type":"Video Files"},{"id":49,"ext":"vob","name":"DVD Video Object File","desc":"Movie data file from a DVD disc, typically stored in the VIDEO_TS folder; contains the majority of data stored on the disc including video, audio, and subtitles; usually formatted as an MPEG-2 system stream and can be opened by various video playback programs.","type":"Game Files"},{"id":50,"ext":"wmv","name":"Windows Media Video File","desc":"Video file based on the Microsoft Advanced Systems Format (ASF) container format and compressed with Windows Media compression; similar to an .ASF file and contains video encoded with one of Microsoft's Windows Media Video (WMV) proprietary codecs.","type":"Video Files"},{"id":51,"ext":"3dm","name":"Rhino 3D Model","desc":"Open-source 3D model format that allows CAD, CAM, CAE, and computer graphics software to accurately save and exchange 3D geometry using both NURBS and polygon mesh representations; used as the native file format for Rhinoceros.","type":"3D Image Files"},{"id":52,"ext":"3ds","name":"3D Studio Scene","desc":"3D image format used by Autodesk 3D Studio; contains mesh data, material attributes, bitmap references, smoothing group data, viewport configurations, camera locations, and lighting information; may also include object animation data.","type":"Game Files"},{"id":53,"ext":"max","name":"3ds Max Scene File","desc":"Three-dimensional scene file created by 3ds Max, a 3D modeling, animation, and rendering application; may contain multiple models that include wireframes, textures, lighting effects, shading, animation, and other 3D design elements; used for developing professional graphics for games, film, and television.","type":"Game Files"},{"id":54,"ext":"obj","name":"Wavefront 3D Object File","desc":"Three-dimensional object containing 3D coordinates, texture maps, and other object information; a standard 3D image format that can be exported and opened by several 3D image editing programs.","type":"Data Files"},{"id":55,"ext":"bmp","name":"Bitmap Image File","desc":"Uncompressed raster image comprised of a rectangular grid of pixels; contains a file header (bitmap identifier, file size, width, height, color options, and bitmap data starting point) and bitmap pixels, each with a different color.","type":"Raster Image Files"},{"id":56,"ext":"dds","name":"DirectDraw Surface","desc":"Raster image format used by Microsoft DirectX to store textures and environments; can store compressed and uncompressed pixel formats; sometimes used for storing Windows desktop backgrounds or wallpapers; also used for texturing video game unit models.","type":"Raster Image Files"},{"id":57,"ext":"gif","name":"Graphical Interchange Format File","desc":"Image file that may contain up to 256 indexed colors; color palette may be a predefined set of colors or may be adapted to the colors in the image; lossless format, meaning the clarity of the image is not compromised with GIF compression.","type":"Raster Image Files"},{"id":58,"ext":"jpg","name":"JPEG Image","desc":"Compressed image format standardized by the Joint Photographic Experts Group (JPEG); commonly used for storing digital photos since the format supports up to 24-bit color; therefore, most digital cameras save images as JPG files by default.","type":"Raster Image Files"},{"id":59,"ext":"png","name":"Portable Network Graphic","desc":"Image file stored in the Portable Network Graphic (PNG) format; contains a bitmap of indexed colors and uses lossless compression, similar to a .GIF file but without copyright limitations; commonly used to store graphics for Web images.","type":"Raster Image Files"},{"id":60,"ext":"psd","name":"Adobe Photoshop Document","desc":"Image file created by Adobe Photoshop, a professional image-editing program; may include image layers, adjustment layers, layer masks, annotation notes, file information, keywords, and other Photoshop-specific elements.","type":"Raster Image Files"},{"id":61,"ext":"pspimage","name":"PaintShop Pro Image","desc":"Graphic saved by Corel PaintShop Photo Pro, a program used for editing images and digital photos; may contain both raster and vector graphics; supports layers, transparency, filters, and other image effects; commonly used for storing touched up photos, as well as for exporting finished images to other raster image file formats.","type":"Raster Image Files"},{"id":62,"ext":"tga","name":"Targa Graphic","desc":"Raster graphic file format designed by Truevision; supports 8, 16, 24, or 32 bits per pixel at a maximum of 24 bits for RGB colors and and 8-bit alpha channel; often used to store texture files referenced by 3D video games.","type":"Raster Image Files"},{"id":63,"ext":"thm","name":"Video Thumbnail File","desc":"Thumbnail image generated by digital camcorders and software programs when a video clip is saved; contains a small image from video clip's first frame; used for visually browsing through a collection of video clips.","type":"Executable Files"},{"id":64,"ext":"tif","name":"Tagged Image File","desc":"High-quality graphics format often used for storing images with many colors, such as digital photos; short for \"TIFF;\" includes support for layers and multiple pages.","type":"Raster Image Files"},{"id":65,"ext":"tiff","name":"Tagged Image File Format","desc":"Graphics container that can store both raster and vector images; may contain high-quality graphics that support color depths from 1 to 24-bit; supports both lossy and lossless compression; also supports multiple layers and pages.","type":"Raster Image Files"},{"id":66,"ext":"yuv","name":"YUV Encoded Image File","desc":"Image created in the YUV format, which splits color across Y, U, and V components; stores the brightness (luminance) as the Y value, and the color (chrominance) as U and V values; can be used for storing color information more accurately than the direct RGB representation.","type":"Video Files"},{"id":67,"ext":"ai","name":"Adobe Illustrator File","desc":"Drawing created with Adobe Illustrator, a vector graphics editing program; composed of paths connected by points, rather than bitmap image data; commonly used for logos and print media.","type":"Game Files"},{"id":68,"ext":"eps","name":"Encapsulated PostScript File","desc":"PostScript (.PS) file that may contain 2D vector graphics, bitmap images, and text; may also include an embedded preview image in bitmap format; can be placed within another PostScript document.","type":"Vector Image Files"},{"id":69,"ext":"ps","name":"PostScript File","desc":"Image saved in the PostScript page description language; may contain vector graphics, raster graphics, and text; can be printed directly by a PostScript printer (i.e., containing a Raster Image Processor) without being opened in an application.","type":"Vector Image Files"},{"id":70,"ext":"svg","name":"Scalable Vector Graphics File","desc":"Two-dimensional vector graphic format created by the World Wide Web Consortium (W3C); developed as a standard format for displaying vector graphics on the Web; describes images using a text format that is based on XML.","type":"Game Files"},{"id":71,"ext":"indd","name":"Adobe InDesign Document","desc":"Professional page layout project created with Adobe InDesign; includes page formatting information, page content, linked files, styles, and swatches; used for creating and formatting books, magazines, newspapers, flyers, brochures, etc.","type":"Page Layout Files"},{"id":72,"ext":"pct","name":"Picture File","desc":"Image stored in the Macintosh PICT format, which was developed by Apple in 1984 for storing images using Apple QuickDraw technology; contains image data in one of two formats, PICT 1, the original format that stores 8 colors, or PICT 2, a newer format that allows thousands of colors (24 and 32-bit images); supports both raster and vector images.","type":"Page Layout Files"},{"id":73,"ext":"pdf","name":"Portable Document Format File","desc":"Cross-platform document created by Adobe Acrobat or a program with the Acrobat plug-in; commonly used for e-mail attachments or for saving publications in a standard format for viewing on multiple computers; usually created from another document instead of from scratch; can be edited with Adobe Acrobat, a commercial program.","type":"Page Layout Files"},{"id":74,"ext":"xlr","name":"Works Spreadsheet","desc":"Spreadsheet or chart created with versions 6-9 of Microsoft Works, a popular productivity suite; stores data in cells that are organized in a grid consisting of rows and columns.","type":"Spreadsheet Files"},{"id":75,"ext":"xls","name":"Excel Spreadsheet","desc":"Spreadsheet created by Microsoft Excel, the most widely-used spreadsheet program; stores data in a table with rows and columns; table cells may contain manually entered data or the results computed from the data of other cells; often used to create charts and graphs.","type":"Spreadsheet Files"},{"id":76,"ext":"xlsx","name":"Microsoft Excel Open XML Spreadsheet","desc":"Spreadsheet created with Microsoft Excel, a program used to create spreadsheets; stores data in worksheets, which contain cells arranged in a grid of rows and columns; may also contain charts, mathematical functions, styles, and formatting; commonly used to store financial data and to create simple or complex mathematical models.","type":"Spreadsheet Files"},{"id":77,"ext":"accdb","name":"Access 2007 Database File","desc":"Database created with Microsoft Access 2007 or later; typically contains data organized into tables and fields; may also include custom forms, SQL queries, and other data.","type":"Database Files"},{"id":78,"ext":"db","name":"Mobile Device Database File","desc":"Database file used on mobile devices such as Android, iOS, and Windows Phone 7 mobile phones; often stores contacts and SMS information but may store any type of device or application data; commonly stored in an SQLite database format but may also be locked or encrypted so the user cannot see the data directly.","type":"Data Files"},{"id":79,"ext":"dbf","name":"Database File","desc":"Standard database file used by dBASE, a database management system application; organizes data into multiple records with fields stored in an array data type; also compatible with other \"xBase\" database programs, which arose because of the file format's popularity.","type":"Data Files"},{"id":80,"ext":"mdb","name":"Microsoft Access Database","desc":"Database file created by Microsoft Access, a widely-used desktop relational database program; contains the database structure (tables and fields) and database entries (table rows) as well as data entry forms, queries, stored procedures, reports, and database security settings.","type":"Data Files"},{"id":81,"ext":"pdb","name":"Program Database","desc":"Database file used by several applications, including Pegasus, Quicken, MS Visual Studio, and Palm Pilot software; stores data in a structured format; typically installed with the corresponding application.","type":"Backup Files"},{"id":82,"ext":"sql","name":"Structured Query Language Data File","desc":"File written in SQL (Structured Query Language); contains SQL code used to modify the contents of a relational database; may contain statements for creating or modifying database structures, or may contain insertions, updates, deletions, and other SQL operations.","type":"Database Files"},{"id":83,"ext":"apk","name":"Android Package File","desc":"Application package created for Android, the Linux-based mobile phone platform developed by Google and the Open Handset Alliance; generated using Google's Android SDK, a Java-based development kit.","type":"Executable Files"},{"id":84,"ext":"app","name":"Mac OS X Application","desc":"Application program (or executable file) that runs under Mac OS X; runs when double-clicked; similar to a .EXE file in Windows.","type":"Executable Files"},{"id":85,"ext":"bat","name":"DOS Batch File","desc":"DOS batch file used to execute commands with the Windows Command Prompt (cmd.exe ); contains a series of line commands that typically might be entered at the DOS command prompt; most commonly used to start programs and run maintenance utilities within Windows.","type":"Executable Files"},{"id":86,"ext":"cgi","name":"Common Gateway Interface Script","desc":"Executable script written in the Perl or C programming language; typically stored in the \"cgi-bin\" folder within a website directory on a Web server; can only be edited if it is not pre-compiled.","type":"Executable Files"},{"id":87,"ext":"com","name":"DOS Command File","desc":"Executable program capable of being run by MS-DOS and Windows; saved in a binary format and is similar to an .EXE file, but differs in that it has a maximum size of roughly 64KB and it has no header or metadata; commonly used for executing a set of instructions whereas EXE files are used for fully developed programs.","type":"Executable Files"},{"id":88,"ext":"exe","name":"Windows Executable File","desc":"Executable program file created for Windows, DOS, or ReactOS operating systems; runs when opened and should execute when double-clicked; can also be a self-extracting archive that extracts files to a specified location.","type":"Executable Files"},{"id":89,"ext":"gadget","name":"Windows Gadget","desc":"Small program that runs within the Windows Vista or Windows 7 sidebar; stores several Web-based files in a Zip archive format; may include .HTML, .CSS, .JS files, as well as other Web files; used for small programs such as news feeds, search tools, system utilities, and small games.","type":"Executable Files"},{"id":90,"ext":"jar","name":"Java Archive File","desc":"Java Archive (JAR) file used by the Java Runtime Environment (JRE), a framework used for executing Java programs;  may serve as a program library or as a standalone program that runs if the JRE is installed on the computer or mobile device.","type":"Executable Files"},{"id":91,"ext":"pif","name":"Program Information File","desc":"Contains information used by Windows to run a certain program, including the path for the .EXE file, how much memory to use, and what size the program's window should be.","type":"Executable Files"},{"id":92,"ext":"vb","name":"VBScript File","desc":"Script written in the VBScript scripting language; can be executed in Windows using the built-in scripting support; may run directly from the operating system or within Internet Explorer.","type":"Audio Files"},{"id":93,"ext":"wsf","name":"Windows Script File","desc":"Executable script for Windows that can incorporate JScript and VBScript routines and may include XML elements; runs itself if WScript or CScript is installed.","type":"Executable Files"},{"id":94,"ext":"dem","name":"Video Game Demo File","desc":"Game replay file created by various first-person shooter games and most popularly by Counter-Strike (supported by Valve's Source game engine); saves a video recording from one player's perspective in a single or multiplayer game; used for sharing replays with others.","type":"GIS Files"},{"id":95,"ext":"gam","name":"Saved Game File","desc":"File created by various video games to store saved games; may be manually saved by the user or automatically saved by the program, for example, at the end of each level; allows the gamer to continue where he or she left off next time the program is opened.","type":"Game Files"},{"id":96,"ext":"nes","name":"Nintendo (NES) ROM File","desc":"Game ROM created from an NES (Nintendo Entertainment System) video game; contains the same data as the original NES cartridge; can be opened and played on a Mac or PC using an NES emulator.","type":"Game Files"},{"id":97,"ext":"rom","name":"N64 Game ROM File","desc":"Nintendo 64 (N64) game file playable with an N64 emulator; stores the contents of an N64 game cartridge in a read-only file format that can be opened and played using a Nintendo 64 emulation program.","type":"Game Files"},{"id":98,"ext":"sav","name":"Mass Effect 3 Saved Game","desc":"Saved game created by Mass Effect 3 (ME3), a galactic action role-playing game; stores the player's profile and includes mission progress, game items, and achievements.","type":"Data Files"},{"id":99,"ext":"dwg","name":"AutoCAD Drawing Database File","desc":"Database of 2D or 3D drawings created with AutoCAD, a professional CAD program; contains vector image data and metadata that describes the contents of the file; related to the .DXF format, which is an ASCII version of DWG.","type":"CAD Files"},{"id":100,"ext":"dxf","name":"Drawing Exchange Format File","desc":"Data format developed by Autodesk and used for CAD (computer-aided design) vector image files, such as AutoCAD documents; similar to the .DWG format, but is more compatible with other programs since it is ASCII (text) based.","type":"CAD Files"},{"id":101,"ext":"gpx","name":"GPS Exchange File","desc":"GPS data file that contains location data formatted in the GPS Exchange Format; includes waypoints, routes, and tracks; uses standard XML formatting that can be imported and read by multiple programs and Web services; allows for the interchange of GPS data between different applications and devices.","type":"Audio Files"},{"id":102,"ext":"kml","name":"Keyhole Markup Language File","desc":"Stores geographic modeling information in XML format; includes points, lines, polygons, and images; used to identify and label locations, create different camera angles, overlay textures, and add HTML content.","type":"GIS Files"},{"id":103,"ext":"kmz","name":"Google Earth Placemark File","desc":"Stores map locations viewable in Google Earth, a global mapping program; provides a bird's eye view of locations throughout the U.S. and other areas of the world; placemarks may include a custom name and the latitudinal and longitudinal coordinates of the location.","type":"GIS Files"},{"id":104,"ext":"asp","name":"Active Server Page","desc":"Server-generated Web page that may contain scripts written in VBScript, C#, or JavaScript; parsed on the server, which generates HTML that is sent to the client's browser; commonly used by ASP.NET sites and websites hosted on Microsoft IIS-based servers.","type":"Settings Files"},{"id":105,"ext":"aspx","name":"Active Server Page Extended File","desc":"Server-generated Web page that may contain VBScript or C# code; often written with Microsoft Visual Web Developer and designed for the Microsoft ASP.NET framework; scripts within the page are processed on the Web server and the resulting HTML is sent to the user's Web browser.","type":"Web Files"},{"id":106,"ext":"cer","name":"Internet Security Certificate","desc":"Security file provided by a third party Certificate Authority, such as VeriSign or Thwate, that verifies the authenticity of a website; installed on a Web server to establish the validity of a certain website hosted on the server.","type":"Web Files"},{"id":107,"ext":"cfm","name":"ColdFusion Markup File","desc":"Web page that contains ColdFusion code, or CFML (ColdFusion Markup Language); can run ColdFusion applications and scripts written in CFScript; may reference database information, generate Flash forms, and create reports on the fly; dynamically executed by the Web server when the page is accessed by a user.","type":"Web Files"},{"id":108,"ext":"csr","name":"Certificate Signing Request File","desc":"File created as a signing request for a digital certificate; contains an encrypted block of text that identifies the applicant of the certificate; includes encrypted data for country, state, organization, domain, email address, and public key; used by a Certificate Authority to establish proof of identity for Web sites.","type":"Web Files"},{"id":109,"ext":"css","name":"Cascading Style Sheet","desc":"Cascading Style Sheet (CSS) file used to format the contents of a Web page; contains customized, global properties for how to display HTML elements; can define the size, color, font, line spacing, indentation, borders, and location of HTML elements.","type":"Web Files"},{"id":110,"ext":"htm","name":"Hypertext Markup Language File","desc":"HTML Web page used by Web browsers; contains markup code that is stored a plain text format; used to display and format text and images in a Web browser.","type":"Web Files"},{"id":111,"ext":"html","name":"Hypertext Markup Language File","desc":"Web page coded in HTML that can be displayed in a Web browser; formats text, tables, images, and other content that is displayed on the page; most pages within static websites have an \".html\" extension.","type":"Web Files"},{"id":112,"ext":"js","name":"JavaScript File","desc":"Text file containing JavaScript code; used to execute JavaScript instructions in Web pages; may include functions that open and close windows, validate form fields, enable rollover images, or create drop-down menus.","type":"Executable Files"},{"id":113,"ext":"jsp","name":"Java Server Page","desc":"Server-generated Web page similar to an .ASP or .PHP file, but contains Java code instead of ActiveX or PHP; the code is parsed by the Web server, which generates HTML that is sent to the user's computer.","type":"Web Files"},{"id":114,"ext":"php","name":"PHP Source Code File","desc":"Web page that may contain PHP (Hypertext Preprocessor) code; may include PHP functions that can process online forms, get the date and time, or access information from a database, such as a MySQL database.","type":"Web Files"},{"id":115,"ext":"rss","name":"Rich Site Summary","desc":"XML-based syndication format that contains news headlines and other Web content; used by many websites for distributing information via RSS in an efficient, text-only format.","type":"Developer Files"},{"id":116,"ext":"xhtml","name":"Extensible Hypertext Markup Language File","desc":"Web page written in XHTML, a reformulation of HTML 4 as an XML 1.0 application; uses standard HTML tags, but must conform to more strict XML guidelines.","type":"Web Files"},{"id":117,"ext":"crx","name":"Chrome Extension","desc":"Extension that adds extra features or themes to the Google Chrome Web browser; saved in a compressed format and may contain .JS, .JSON, and other files, such as images and executable programs; used for installing browser addons such as games, ad blockers, and news readers.","type":"Plugin Files"},{"id":118,"ext":"plugin","name":"Mac OS X Plug-in","desc":"Adds additional features or hardware support to programs in Mac OS X; often installed in a folder within the main Library folder; common examples include the \"\/Library\/Internet Plug-Ins\" and \"Library\/Printers\/[Manufacturer]\" folders.","type":"Plugin Files"},{"id":119,"ext":"fnt","name":"Windows Font File","desc":"Font file used by the Windows operating system, often saved within the system fonts directory; stores a generic font and may include vector and raster glyphs.","type":"Font Files"},{"id":120,"ext":"fon","name":"Generic Font File","desc":"Windows 3.x font library file; older font format that cannot be resized to any size like a TrueType (.TTF) font; may also look different on screen than paper; referenced by programs that access system fonts.","type":"Font Files"},{"id":121,"ext":"otf","name":"OpenType Font","desc":"Font format developed by Adobe and Microsoft; combines aspects of PostScript and TrueType font formats; fully scalable, meaning the font can be resized without losing quality.","type":"Misc Files"},{"id":122,"ext":"ttf","name":"TrueType Font","desc":"Font file format created by Apple, but used on both Macintosh and Windows platforms; can be resized to any size without losing quality; also looks the same when printed as it does on the screen.","type":"Font Files"},{"id":123,"ext":"cab","name":"Windows Cabinet File","desc":"Archive format native to Microsoft Windows that contains compressed data; supports .ZIP, Quantum, and LZX data compression algorithms; used for Windows software installations such as system files, network components, and device drivers.","type":"System Files"},{"id":124,"ext":"cpl","name":"Windows Control Panel Item","desc":"Control panel item, such as Displays, Mouse, Sound, or Networking, used by the Windows operating system; stored in the \"Windows\\ System\" folder and are loaded automatically when the Windows Control Panel is opened.","type":"System Files"},{"id":125,"ext":"cur","name":"Windows Cursor","desc":"Cursor image or animation used for the Windows mouse pointer; for example, may be an arrow (for general use), a spinning hourglass (for waiting periods), or an I-bar (for text editing); custom desktop themes (.THEME files) may change the cursor image\/animation, such as turning the hourglass into a watch.","type":"System Files"},{"id":126,"ext":"deskthemepack","name":"Windows 8 Desktop Theme Pack File","desc":"Desktop theme file introduced with the Windows 8 operating system; saved in the .CAB format and contains background images (.JPG files) as well as a .THEME file, which contains colors, sounds, and other settings used to customize the Windows desktop; can be downloaded and shared with other Windows users.","type":"System Files"},{"id":127,"ext":"dll","name":"Dynamic Link Library","desc":"Compiled library file containing a set of procedures and\/or drivers that are referenced and executed by a Windows program; allows multiple programs to access shared system functions through common libraries; may be dynamically linked into a program at runtime.","type":"Web Files"},{"id":128,"ext":"dmp","name":"Windows Memory Dump","desc":"Data \"dumped\" from a program's memory space; often created when a program has an error or crashes; may also be saved by the program \"Savedump.exe\" on the first reboot after a crash; usually named \"Memory.dmp.\"","type":"System Files"},{"id":129,"ext":"drv","name":"Device Driver","desc":"Driver file used by Windows operating systems to connect and communicate with hardware devices (both external and internal); contains commands and parameters for how device and the operating system communicate together; also used to install a device driver on a computer.","type":"System Files"},{"id":130,"ext":"icns","name":"Mac OS X Icon Resource File","desc":"Icon file used by Mac OS X applications; stores one or more images, typically which were originally .PNG files; supports 1-bit and 8-bit alpha channels; used for displaying the application icon in the Mac OS X Finder and in the OS X dock.","type":"System Files"},{"id":131,"ext":"ico","name":"Icon File","desc":"Image format used for storing icons for Windows programs, files, and folders; contains two bitmaps: 1) the AND bitmap - the image mask (which determines what part of the icon is transparent) and 2) the XOR bitmap - contains the icon which is mapped onto the image mask; ICO files can be modified to create custom icons.","type":"System Files"},{"id":132,"ext":"lnk","name":"Windows File Shortcut","desc":"Shortcut or \"link\" used by Windows as a reference to an original file, similar to an alias on the Macintosh platform; contains the shortcut target type, location, and filename as well as the program that opens the target file and an optional shortcut key; can be created in Windows by right-clicking a file and then selecting \"Create Shortcut.\"","type":"System Files"},{"id":133,"ext":"sys","name":"Windows System File","desc":"File used by Microsoft DOS and Windows operating systems; contains system settings and variables, as well as functions that are used to run the operating system; commonly used to store device drivers and other core Windows functions.","type":"System Files"},{"id":134,"ext":"cfg","name":"Configuration File","desc":"Generic preference file that stores settings and configuration information; used by various programs, which means different CFG files may store data in different formats; typically should not be opened manually, but may be saved in a text format that can be viewed in a text editor; can sometimes be moved or deleted to revert to a program's default settings.","type":"Settings Files"},{"id":135,"ext":"ini","name":"Windows Initialization File","desc":"Configuration file used by Windows programs to initialize program settings; contains sections for settings and preferences (delimited by a string in square brackets) with each section containing one or more name and value parameters.","type":"Data Files"},{"id":136,"ext":"prf","name":"Outlook Profile File","desc":"User profile referenced by Microsoft Outlook that contains user information and preferences; includes mail account settings, signatures, references to mail folders, and other settings; when Outlook imports a PRF file, the user profile settings are immediately updated.","type":"Data Files"},{"id":137,"ext":"hqx","name":"BinHex 4.0 Encoded File","desc":"Binary to Hexadecimal text file created for Mac computers; contains data that has been compressed and encoded from an 8-bit binary format into a 7-bit text format; can be useful for transferring binary images, documents, and multimedia as text in email attachments.","type":"Encoded Files"},{"id":138,"ext":"mim","name":"Multi-Purpose Internet Mail Message File","desc":"Encoded file used by email programs; contains 8-bit data or other characters besides the US ASCII character set; used to support 8-bit content, such as file attachments, instead of standard 7-bit messages that are normally sent over email; typically include the MIME version, the content type, and the encoding method.","type":"Encoded Files"},{"id":139,"ext":"uue","name":"Uuencoded File","desc":"File encoded with uuencode, a Unix program that converts binary files to a text format; stores the encoded textual representation of a binary file; commonly used for emailing documents so the file does not become corrupted; must first be decoded to open the original file.","type":"Encoded Files"},{"id":140,"ext":"7z","name":"7-Zip Compressed File","desc":"Compressed archive created with Igor Pavlov's 7-Zip file compression utility; uses open-source LZMA compression, which has a high compression ratio and can include strong AES-256 (256-bit) encryption; supports Unicode file names, archive header compression, and file sizes up to 16,000,000,000 GB.","type":"Compressed Files"},{"id":141,"ext":"cbr","name":"Comic Book RAR Archive","desc":"Compressed set of .JPEG, .PNG, or static .GIF images saved in a single .RAR archive with the \".cbr\" extension; contains pages that are automatically ordered and can be presented one or two at a time; used for storing and displaying comic books or other collections of pages.","type":"Compressed Files"},{"id":142,"ext":"deb","name":"Debian Software Package","desc":"Standard Unix archive that contains two bzipped or gzipped archives; one for the installer control information and another for the actual data; typically used for software installation packages.","type":"Compressed Files"},{"id":143,"ext":"gz","name":"Gnu Zipped Archive","desc":"Archive file compressed by the standard GNU zip (gzip) compression algorithm; contains a compressed collection of one or more files; commonly used on Unix operating systems for file compression.","type":"Compressed Files"},{"id":144,"ext":"pkg","name":"PlayStation Store Downloaded Package","desc":"File downloaded from Sony's PlayStation Store, an online store with games, movies, and demos for PS3 and PSP devices; used specifically for downloadable games, game updates, and demos; saved in an encrypted format that is only recognized by compatible Sony devices.","type":"3D Image Files"},{"id":145,"ext":"rar","name":"WinRAR Compressed Archive","desc":"File archive containing one or more files compressed with RAR compression; uses a higher compression ratio than typical ZIP compression; incorporates a proprietary compression algorithm that is now used by other compressors, including 7-Zip for its .7Z files; may be extracted using a variety of programs.","type":"Compressed Files"},{"id":146,"ext":"rpm","name":"Red Hat Package Manager File","desc":"Installation package originally developed for the Red Hat Linux operating system, but now used by many other Linux distributions as well; commonly used for installing programs on Linux systems.","type":"Plugin Files"},{"id":147,"ext":"sitx","name":"StuffIt X Archive","desc":"Compressed archive format created by Smith Micro StuffIt 7.0 or later; introduced in 2002, StuffIt X uses Smith Micro's exclusive ATOM compression technology and offers up to 20% more compression than standard Stuffit (.SIT) archives.","type":"Compressed Files"},{"id":148,"ext":"tar.gz","name":"Compressed Tarball File","desc":"TAR archive compressed with the standard GNU zip (gzip) compression algorithm; contains one or more compressed files; commonly used on Unix operating systems to package files, programs, and installers.","type":"Compressed Files"},{"id":149,"ext":"zip","name":"Zipped File","desc":"File compressed or \"zipped\" using Zip compression, a common type of compression in which every file in the archive is compressed separately; supported by most file compression\/decompression programs.","type":"Game Files"},{"id":150,"ext":"zipx","name":"Extended Zip File","desc":"Compressed Zip file saved in the extended Zip format, introduced with WinZip 12.1; creates smaller files than the previous versions of the .ZIP format; contains one or more files saved as a compressed file archive.","type":"Compressed Files"},{"id":151,"ext":"bin","name":"BlackBerry IT Policy File","desc":"Configuration file named policy.bin  and used for making administrative updates to BlackBerry Desktop Software and the BlackBerry Wireless Handheld; often distributed by IT system adminstrators to company computers; may be stored on the desktop or other locations specified by the system administrator when distributing configuration updates.","type":"Data Files"},{"id":152,"ext":"cue","name":"Cue Sheet File","desc":"Text file that defines the way tracks are organized on compact discs and super-audio CDs (SACDs); may contain the song name, performer, and length of each track on the disc; written in a standard format and therefore are recognized by most CD playback and editing programs.","type":"Disk Image Files"},{"id":153,"ext":"dmg","name":"Mac OS X Disk Image","desc":"Mountable disk image created in Mac OS X; contains raw block data typically compressed and sometimes encrypted; commonly used for Mac OS software installers that are downloaded from the Internet; mounts a virtual disk on the desktop when opened.","type":"Disk Image Files"},{"id":154,"ext":"iso","name":"Disc Image File","desc":"Common CD or DVD disc image format based on the ISO-9660 standard; contains an exact duplicate of data from the original disc; includes the data saved on the disc as well as the filesystem information, such as directory structures, file attributes, and boot code; often used for making copies of CDs and DVDs.","type":"CAD Files"},{"id":155,"ext":"mdf","name":"Media Disc Image File","desc":"CD or DVD data saved as a disc image by a disc authoring program such as Alcohol 120%; similar to an .ISO file, but saved in a different format; actual disc data is stored in the MDF file, while the header and track information is stored in a corresponding .MDS file.","type":"Data Files"},{"id":156,"ext":"toast","name":"Toast Disc Image","desc":"CD or DVD disc image created with Roxio Toast, a popular disc authoring program for the Mac; similar to a standard .ISO disc image, but contains specific Toast formatting information.","type":"Disk Image Files"},{"id":157,"ext":"vcd","name":"Virtual CD","desc":"Disc image of a CD or DVD; recognized by Windows as an actual disc, even though the data is on the hard drive; allows CDs and DVDs to be used without requiring physical drives; useful for mounting discs on network computers.","type":"Data Files"},{"id":158,"ext":"c","name":"C\/C++ Source Code File","desc":"Source code for a C or C++ program; may include an entire program's source code, or may be one of may source files referenced within a programming project; can be edited using a basic text editor, but will not show syntax highlighting like most software development programs do.","type":"Developer Files"},{"id":159,"ext":"class","name":"Java Class File","desc":"Compiled .JAVA file created by the Java compiler; contains bytecode, which is binary program code that is executable when run by a Java Virtual Machine (JVM); commonly bundled in to .JAR files, which are included in the $CLASSPATH environment variable for execution.","type":"Developer Files"},{"id":160,"ext":"cpp","name":"C++ Source Code File","desc":"Source code file written in C++, a popular programming language that adds features such as object-oriented programming to C; can be a standalone program or one of many files references in a development project; must be compiled by a C++ compiler for the target platform before run.","type":"Developer Files"},{"id":161,"ext":"cs","name":"Visual C# Source Code File","desc":"Source code file written in C# (pronounced \"C Sharp\"), an object-oriented programming language created by Microsoft for use with the .NET Framework; used for developing a range of applications, from simple desktop programs to applications for distributed   environments.","type":"Data Files"},{"id":162,"ext":"dtd","name":"Document Type Definition File","desc":"Text file that specifies elements and attributes used in an XML, SGML, HTML, or XHTML document; can also define the ordering and nesting for elements and their attributes; commonly referenced within Web pages using a URL.","type":"Data Files"},{"id":163,"ext":"fla","name":"Adobe Flash Animation","desc":"Editable movie or animation created with Adobe Flash; often saved as a .SWF file for use on the Web; the FLA file is the editable project file saved by the Flash development program; the SWF (or \"swiff\") file is a compressed format that is viewable in most Web browsers with the Flash plugin.","type":"Developer Files"},{"id":164,"ext":"h","name":"C\/C++\/Objective-C Header File","desc":"Header file referenced by a C, C++ or Objective-C source code document; may contain variables, constants, and functions that are used by other files within a programming project; allows commonly used functions to be written only once and referenced by other source files when needed.","type":"Developer Files"},{"id":165,"ext":"java","name":"Java Source Code File","desc":"Source code file written in the Java programming language, which was originally developed by Sun Microsystems but is now maintained by Oracle; uses an object-oriented approach, where structured data types, called classes, are used to instantiate objects at runtime.","type":"Developer Files"},{"id":166,"ext":"lua","name":"Lua Source File","desc":"Source code written in Lua, a light-weight programming language designed for extending applications; can be compiled into a program using an ANSI C compiler.","type":"Developer Files"},{"id":167,"ext":"m","name":"Objective-C Implementation File","desc":"Class implementation file used by programs written in Objective-C; begins with the @implementation directive; initializes variables and functions that can be referenced by other Objective-C source files; may also reference header (.H) files.","type":"Developer Files"},{"id":168,"ext":"pl","name":"Perl Script","desc":"Script written in Perl that is compiled and run using a Perl interpreter; contains lines of Perl program code with variables, operations, functions, and comments; may be difficult to read due to the brief and compact nature of the Perl language syntax.","type":"Developer Files"},{"id":169,"ext":"py","name":"Python Script","desc":"Program file or script written in Python, an interpreted object-oriented programming language; can be created and edited with a text editor, but requires a Python interpreter to run; often used for programming Web servers and other administrative computer systems.","type":"Developer Files"},{"id":170,"ext":"sh","name":"Bash Shell Script","desc":"Script programmed for bash, a type of Unix shell (Bourne-Again SHell); contains instructions written in the Bash language; can be executed by typing text commands within the shell's command-line interface.","type":"Compressed Files"},{"id":171,"ext":"sln","name":"Visual Studio Solution File","desc":"Structure file for organizing projects in Microsoft Visual Studio; contains text-based information about the project environment and project state.","type":"Developer Files"},{"id":172,"ext":"vcxproj","name":"Visual C++ Project","desc":"Software development project created by Visual C++, a component of Microsoft Visual Studio used to develop programs in C++; stores project information in an XML format, including references to source code files and application assets; used for developing and building executable programs.","type":"Developer Files"},{"id":173,"ext":"xcodeproj","name":"Xcode Project","desc":"Mac OS X or iOS software development project created with Apple's Xcode programming software; contains project configuration data and links to files referenced by the project.","type":"Developer Files"},{"id":174,"ext":"bak","name":"Firefox Bookmarks Backup","desc":"Backup of the Firefox bookmarks file; can be used to replace saved bookmarks in case the main bookmarks file becomes corrupted; automatically generated by the Firefox Web browser; typically named \"bookmarks.bak\"","type":"Backup Files"},{"id":175,"ext":"tmp","name":"Temporary File","desc":"Temporary file created automatically by a software program; usually serves as a backup or cache file; sometimes created as an invisible file and is often deleted when the program is closed; may also be called a \"temp file.\"","type":"Backup Files"},{"id":176,"ext":"crdownload","name":"Chrome Partially Downloaded File","desc":"Partially downloaded file created by the Google Chrome Web browser; stores the contents of a file as it is being received by the browser; uses the \".crdownload\" extension to mark the download as incomplete until it is finished, at which point the \".crdownload\" extension is removed.","type":"Misc Files"},{"id":177,"ext":"ics","name":"IC Recorder Sound File","desc":"Audio file created by a Sony IC recorder (e.g., the Sony ICD-R100), a handheld device used for recording personal messages; commonly used for storing voice audio, which is useful for forensics and legal environments, as well as for general personal memos.","type":"CAD Files"},{"id":178,"ext":"msi","name":"Windows Installer Package","desc":"Contains installation information for a particular installer, such as files to be installed and installation locations; may be used for Windows updates as well as third-party software installers.","type":"Misc Files"},{"id":179,"ext":"part","name":"Partially Downloaded File","desc":"File that has been partially downloaded from the Internet; used for downloads that are in progress or have been stopped; some PART files can be resumed at a later time using the same program that started the download.","type":"Misc Files"},{"id":180,"ext":"torrent","name":"BitTorrent File","desc":"URL of a file or group of files downloadable with BitTorrent, a peer-to-peer (P2P) file sharing program; used for downloading a file, often from multiple locations at one time; contains data about the file to be downloaded, but not the file data itself.","type":"Misc Files"}]